{"config": [{"config": {"output_shape_type": "raw", "output_shape": null, "arguments": {}, "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 16, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\n.\\model.py\u00da\b<lambda>T\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dtype": "float32", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "filters": 12, "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null, "batch_input_shape": [null, 16, 32, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "filters": 24, "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null, "batch_input_shape": [null, 16, 32, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 100, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "units": 50, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Sequential"}